Revit 2027 API
IRebarUpdateServer.TrimExtendCurves Method
 This function is supposed to trim or extend curves that were obtained from calling GenerateCurves(). Also in this function can be set new constraints for start and end handles.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool TrimExtendCurves(
	RebarTrimExtendData trimExtendData
)
Function TrimExtendCurves (
	trimExtendData As RebarTrimExtendData
) As Boolean
bool TrimExtendCurves(
	RebarTrimExtendData^ trimExtendData
)
abstract TrimExtendCurves :
        trimExtendData : RebarTrimExtendData -> bool
Parameters
trimExtendData RebarTrimExtendData
 Use the members of this class to access the inputs and define any trim/extend actions to be taken for bars in the free form rebar.
Return Value
Boolean
 Returns true if the trim/extend was successful, false otherwise.
Remarks
This function is called in the regeneration context when at least one data in trimExtendData parameter was changed. It is called immediately after GenerateCurves() and only if GenerateCurves() returns true.
If new constraints were created for start or end handle, a new regeneration will take place and the new constraints will become the rebar's actual constraints.
If new curves will be added by calling TrimExtendData.AddBarGeometry(), the existing curves in Rebar element will be replaced with these curves. It will not add curves to the existing ones.
See Also
Reference
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace